miniproject0/case2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    wallL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          425;
        startFace       37025;
    }
    wallR
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       37450;
    }
    wallExpansion
    {
        type            wall;
        inGroups        1(wall);
        nFaces          225;
        startFace       37650;
    }
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       37875;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       37900;
    }
    twoD
    {
        type            empty;
        inGroups        1(empty);
        nFaces          37500;
        startFace       37950;
    }
    collapsedFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       75450;
    }
)

// ************************************************************************* //
